src/DataProcessors/МассовоеИзменениеЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МассовоеИзменениеЦен</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыУстановокЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыУстановокЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПорчаТоваров</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ИзменениеАссортимента</xr:Item>
				<xr:Item>Document.ПриемкаТоваровНаХранение</xr:Item>
				<xr:Item>Document.ВводОстатков</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры25</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУстановокЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИзмененаВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары2_5</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаЦО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияЦО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатурыДляЦенообразования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаЦО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИзмененаВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиКомпоновкиДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/МассовоеИзменениеЦен/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДатаУстановки               = ТекущаяДатаСеанса();
	ВключаяПодгруппы            = Истина;
	ПроцентИзменения            = 0;
	ШагОкругления               = 0;
	ТолькоСУстановленнойЦеной   = Ложь;

	НастроитьВидимостьКолонокТаблицы();
	НастроитьУсловноеОформление();
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Не ЕстьНесохранённыеИзменения() Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,
		НСтр("ru = 'В таблице есть рассчитанные изменения цен, которые ещё не записаны.
			|Закрыть форму без сохранения?'"),
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитов

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)

	ОчиститьТаблицуНоменклатуры();
	ВалютаВидаЦены = ПолучитьВалютуВидаЦены(ВидЦены);
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура ГруппаНоменклатурыПриИзменении(Элемент)

	ОчиститьТаблицуНоменклатуры();

КонецПроцедуры

&НаКлиенте
Процедура ВключаяПодгруппыПриИзменении(Элемент)

	ОчиститьТаблицуНоменклатуры();

КонецПроцедуры

&НаКлиенте
Процедура ДатаУстановкиПриИзменении(Элемент)

	ОчиститьТаблицуНоменклатуры();

КонецПроцедуры

&НаКлиенте
Процедура ПроцентИзмененияПриИзменении(Элемент)

	ПересчитатьНовыеЦеныНаКлиенте();
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура ШагОкругленияПриИзменении(Элемент)

	ПересчитатьНовыеЦеныНаКлиенте();
	ОбновитьДоступностьКоманд();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицы

&НаКлиенте
Процедура ТаблицаНоменклатурыНоваяЦенаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТаблицаНоменклатуры.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.ЦенаИзмененаВручную = Истина;
	ТекущаяСтрока.Изменилась          = (ТекущаяСтрока.НоваяЦена <> ТекущаяСтрока.ТекущаяЦена);

	ОбновитьДоступностьКоманд();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Заполнить(Команда)

	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран вид цены.'"));
		Возврат;
	КонецЕсли;

	ЗаполнитьНаСервере();
	ПересчитатьНовыеЦеныНаКлиенте();
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)

	ОчиститьТаблицуНоменклатуры();

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЦены(Команда)

	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран вид цены.'"));
		Возврат;
	КонецЕсли;

	КоличествоОбрабатываемых = КоличествоСтрокДляЗаписи();
	Если КоличествоОбрабатываемых = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нет отмеченных строк с изменёнными ценами.'"));
		Возврат;
	КонецЕсли;

	ТекстВопроса = СтрШаблон(
		НСтр("ru = 'Будет создан и проведён документ установки цен на %1 позиций. Продолжить?'"),
		КоличествоОбрабатываемых);

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьЦеныЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	РезультатЗаписи = ЗаписатьЦеныНаСервере();

	Если РезультатЗаписи.Успех Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены установлены'"),
			ПолучитьНавигационнуюСсылку(РезультатЗаписи.Ссылка),
			Строка(РезультатЗаписи.Ссылка),
			БиблиотекаКартинок.Информация32);
		ОбновитьДоступностьКоманд();
	Иначе
		ПоказатьПредупреждение(, РезультатЗаписи.Сообщение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПометки(Команда)

	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПометки(Команда)

	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоследнийДокумент(Команда)

	Если ЗначениеЗаполнено(СсылкаНаПоследнийДокумент) Тогда
		ОткрытьЗначение(СсылкаНаПоследнийДокумент);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКлиент

&НаКлиенте
Процедура ОчиститьТаблицуНоменклатуры()

	ТаблицаНоменклатуры.Очистить();
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНовыеЦеныНаКлиенте()

	Для Каждого Строка Из ТаблицаНоменклатуры Цикл

		РасчётнаяЦена = Строка.ТекущаяЦена * (1 + ПроцентИзменения / 100);

		Если ШагОкругления > 0 Тогда
			РасчётнаяЦена = Окр(РасчётнаяЦена / ШагОкругления, 0) * ШагОкругления;
		Иначе
			РасчётнаяЦена = Окр(РасчётнаяЦена, 2);
		КонецЕсли;

		Строка.НоваяЦена  = РасчётнаяЦена;
		Строка.Изменилась = (Строка.НоваяЦена <> Строка.ТекущаяЦена);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция КоличествоСтрокДляЗаписи()

	Количество = 0;
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Если Строка.Пометка И Строка.Изменилась Тогда
			Количество = Количество + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Количество;

КонецФункции

&НаКлиенте
Функция ЕстьНесохранённыеИзменения()

	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Если Строка.Изменилась Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьКоманд()

	ВидЦеныЗаполнен      = ЗначениеЗаполнено(ВидЦены);
	ЕстьСтрокиДляЗаписи  = (КоличествоСтрокДляЗаписи() > 0);
	ЕстьПоследнийДокумент = ЗначениеЗаполнено(СсылкаНаПоследнийДокумент);

	Элементы.КнопкаЗаполнить.Доступность                  = ВидЦеныЗаполнен;
	Элементы.КнопкаЗаписатьЦены.Доступность               = ВидЦеныЗаполнен И ЕстьСтрокиДляЗаписи;
	Элементы.КнопкаОткрытьПоследнийДокумент.Доступность   = ЕстьПоследнийДокумент;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервер

&НаСервере
Процедура НастроитьВидимостьКолонокТаблицы()

	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	ИспользоватьУпаковки       = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");

	Элементы.ТаблицаНоменклатурыХарактеристика.Видимость = ИспользоватьХарактеристики;
	Элементы.ТаблицаНоменклатурыУпаковка.Видимость       = ИспользоватьУпаковки;

КонецПроцедуры

&НаСервере
Процедура НастроитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// Жёлтая заливка изменённых строк.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЖелтый);

	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНоменклатурыНоваяЦена");

	ОтборЭлемент = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаНоменклатуры.Изменилась");
	ОтборЭлемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемент.ПравоеЗначение = Истина;

	// Красный текст для нулевых/отрицательных цен.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);

	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНоменклатурыНоваяЦена");

	ОтборЭлемент = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаНоменклатуры.НоваяЦена");
	ОтборЭлемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемент.ПравоеЗначение = 0;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуВидаЦены(ВидЦены)

	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат Справочники.Валюты.ПустаяСсылка();
	КонецЕсли;

	Возврат ВидЦены.ВалютаЦены;

КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()

	ТаблицаНоменклатуры.Очистить();

	Запрос = Новый Запрос;

	ТекстОтбораПоГруппе = ?(ВключаяПодгруппы,
		"Номенклатура.Родитель В ИЕРАРХИИ (&ГруппаНоменклатуры)",
		"Номенклатура.Родитель = &ГруппаНоменклатуры");

	ТипСоединения = ?(ТолькоСУстановленнойЦеной, "ВНУТРЕННЕЕ", "ЛЕВОЕ");

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(Цены.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЕСТЬNULL(Цены.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,
	|	ЕСТЬNULL(Цены.Цена, 0) КАК ТекущаяЦена,
	|	ЕСТЬNULL(Цены.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаУстановки, ВидЦены = &ВидЦены) КАК Цены
	|		ПО Цены.Номенклатура = Номенклатура.Ссылка
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И " + ТекстОтбораПоГруппе + "
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование";

	Запрос.УстановитьПараметр("ВидЦены",            ВидЦены);
	Запрос.УстановитьПараметр("ДатаУстановки",      ДатаУстановки);
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока                     = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Пометка             = Истина;
		НоваяСтрока.Номенклатура        = Выборка.Номенклатура;
		НоваяСтрока.Характеристика      = Выборка.Характеристика;
		НоваяСтрока.Упаковка            = Выборка.Упаковка;
		НоваяСтрока.ТекущаяЦена         = Выборка.ТекущаяЦена;
		НоваяСтрока.Валюта              = ?(ЗначениеЗаполнено(Выборка.Валюта), Выборка.Валюта, ВалютаВидаЦены);
		НоваяСтрока.НоваяЦена           = Выборка.ТекущаяЦена;
		НоваяСтрока.Изменилась          = Ложь;
		НоваяСтрока.ЦенаИзмененаВручную = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗаписатьЦеныНаСервере()

	Результат = Новый Структура("Успех, Ссылка, Сообщение", Ложь, Неопределено, "");

	НачатьТранзакцию();
	Попытка

		Документ = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		Документ.Дата          = ДатаУстановки;
		Документ.Ответственный = Пользователи.ТекущийПользователь();
		Документ.Статус        = Перечисления.СтатусыУстановокЦенНоменклатуры.НеСогласован;

		СтрокаВидаЦены = Документ.ВидыЦен.Добавить();
		СтрокаВидаЦены.ВидЦены = ВидЦены;

		Для Каждого СтрокаТЗ Из ТаблицаНоменклатуры Цикл

			Если Не (СтрокаТЗ.Пометка И СтрокаТЗ.Изменилась) Тогда
				Продолжить;
			КонецЕсли;

			СтрокаТовары = Документ.Товары2_5.Добавить();
			СтрокаТовары.Номенклатура         = СтрокаТЗ.Номенклатура;
			СтрокаТовары.ХарактеристикаЦО     = СтрокаТЗ.ХарактеристикаЦО;
			СтрокаТовары.Упаковка             = СтрокаТЗ.Упаковка;
			СтрокаТовары.ВидЦены              = ВидЦены;
			СтрокаТовары.Цена                 = СтрокаТЗ.НоваяЦена;
			СтрокаТовары.Валюта               = ?(ЗначениеЗаполнено(СтрокаТЗ.Валюта), СтрокаТЗ.Валюта, ВалютаВидаЦены);
			СтрокаТовары.ЦенаИзмененаВручную  = СтрокаТЗ.ЦенаИзмененаВручную;

		КонецЦикла;

		Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

		СсылкаНаПоследнийДокумент = Документ.Ссылка;

		ЗафиксироватьТранзакцию();

		Результат.Успех  = Истина;
		Результат.Ссылка = Документ.Ссылка;

	Исключение

		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
			"МассовоеИзменениеЦен.ЗаписьЦен",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		Результат.Успех     = Ложь;
		Результат.Сообщение = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);

	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти
